/* BizSimAI - Spanish Localization */

/* Common */
"app.name" = "BizSimAI";
"common.login" = "Iniciar sesión";
"common.logout" = "Cerrar sesión";
"common.save" = "Guardar";
"common.cancel" = "Cancelar";
"common.error" = "Error";
"common.loading" = "Cargando...";
"common.success" = "Éxito";
"common.retry" = "Reintentar";
"common.submit" = "Enviar";
"common.back" = "Atrás";
"common.done" = "Listo";
"common.delete" = "Eliminar";
"common.edit" = "Editar";
"common.close" = "Cerrar";

/* Authentication */
"auth.professor_login" = "Acceso Profesor";
"auth.student_access" = "Acceso Estudiante";
"auth.username" = "Nombre de usuario";
"auth.password" = "Contraseña";
"auth.student_id" = "ID de Estudiante";
"auth.full_name" = "Nombre completo";
"auth.team_name" = "Nombre del equipo";
"auth.register" = "Registrarse y unirse";
"auth.sign_in_apple" = "Iniciar sesión con Apple";
"auth.sign_in_google" = "Iniciar sesión con Google";
"auth.session_expired" = "Sesión expirada. Por favor, inicie sesión de nuevo.";

/* Session */
"session.create" = "Crear Sesión";
"session.join" = "Unirse a la Sesión";
"session.code" = "Código de Sesión";
"session.round" = "Ronda %d de %d";
"session.status_waiting" = "Esperando Jugadores";
"session.status_active" = "En Progreso";
"session.status_completed" = "Completada";
"session.end" = "Finalizar Sesión";
"session.delete" = "Eliminar Sesión";

/* Decisions */
"decision.submit" = "Enviar Decisiones";
"decision.submitted" = "Decisiones Enviadas";
"decision.over_budget" = "Sobre el presupuesto";
"decision.invalid" = "Decisiones inválidas";

/* Results */
"results.leaderboard" = "Tabla de Clasificación";
"results.profit" = "Ganancia";
"results.revenue" = "Ingresos";
"results.market_share" = "Participación de Mercado";
"results.stock_price" = "Precio de la Acción";
"results.cumulative" = "Acumulado";

/* Sync */
"sync.online" = "En línea";
"sync.offline" = "Sin conexión";
"sync.syncing" = "Sincronizando...";
"sync.error" = "Error de sincronización";
"sync.saved_locally" = "Guardado localmente";

/* Professor */
"prof.dashboard" = "Panel";
"prof.sessions" = "Sesiones";
"prof.analytics" = "Analíticas";
"prof.announcements" = "Anuncios";
"prof.grade_mapping" = "Mapeo de Calificaciones";

/* Student */
"student.team_dashboard" = "Panel del Equipo";
"student.ai_coach" = "Entrenador IA";
"student.performance" = "Rendimiento";

/* Navigation */
"nav.home" = "Inicio";
"nav.settings" = "Configuración";
"nav.profile" = "Perfil";
"nav.help" = "Ayuda";

/* Errors */
"error.network" = "Error de red. Por favor, verifique su conexión.";
"error.server" = "Error del servidor. Por favor, intente más tarde.";
"error.unauthorized" = "No autorizado. Por favor, inicie sesión de nuevo.";
"error.not_found" = "Recurso no encontrado.";
